package com.example.holidaytest4.utils;

/**
 * 景区景物描述类
 */
public class ScenicDescribeUtils {
    /**
     * 中科大
     */
    public static String getZKD() {
        return "中国科学技术大学（University of Science and Technology of China），标准简称为中国科大或USTC，常用简称科大、中科大、中国科技大学或科技大，是中国大陆的一所公立研究型大学，主体部分位于安徽省合肥市。\n" +
                "\n" +
                "中国科学技术大学隶属于中国科学院，是一所由中国科学院直属管理的全国重点大学。本科生生源质量和培养质量一直在全国高校中名列前茅（2016、2017年高考招生平均分位于全国第四[4]）。为中国首批7所“211工程”重点建设的大学和首批9所“985工程”重点建设的大学之一[5]，也是唯一参与国家知识创新工程的大学，九校联盟（C9）和长三角高校合作联盟的重要成员，中国大学校长联谊会成员。2017年被教育部评选为世界一流大学。学校在国际上也享有一定声誉，是东亚研究型大学协会和环太平洋大学联盟的成员。" +
                "办学目标定位于“质量优异、特色鲜明的一流研究型大学”[6]。\n" +
                "\n" ;
    }
    /**
     * 颍上一中
     */
    public static String getYS() {
        return " 省级示范高中颍上一中建于1909年，有着百余年的历史。学校底蕴深厚，人才辈出。从这里走出了著名作家戴厚英、诗人阿红，美学大师常任侠，“两院”院士郑守仁、陈国良等一大批卓有成就的学子。学校自2000年以来连续九次蝉联省级“文明单位”称号。系全国读书育人先进单位、国家级青少年体育俱乐部，省教育系统先进单位、省家教名校、" +
                "省综合治理先进单位、省专项体育特色学校、省新课程实验样本校。\n" +
                "\n" ;
    }
    /**
     * 九华山
     */
    public static String getJUS() {
        return " 九华山天开神奇，清丽脱俗，是大自然造化的精品，有“莲花佛国”之称。境内群峰竞秀，怪石林立，九大主峰如九朵莲花，千姿百态，各具神韵。连绵山峰形成的天然睡佛，成为自然景观与佛教文化有机融合的典范。景区内处处清溪幽潭、飞瀑流泉，构成了一幅幅清新自然的山水画卷。还有云海、日出、雾淞、佛光等自然奇观，气象万千，美不胜收，素有“秀甲江南”之誉。\n" +
                "\n" +"九华山文化底蕴深厚。晋唐以来，陶渊明、李白、费冠卿、杜牧、苏东坡、王安石等文坛大儒游历于此，吟诵出一首首千古绝唱，黄宾虹、张大千、刘海粟、李可染等丹青巨匠挥毫泼墨，留下了一幅幅传世佳作。唐代大诗人李白三上九华，写下了数十首赞美九华山的不朽诗篇，尤其是“妙有分二气，灵山开九华”的诗句，成了九华山的“定名篇”。九华山现存文物2000多件，历代名人雅士的诗词歌赋500多篇，书院、书堂遗址20多处，其中唐代贝叶经、明代大藏经、血经，明万历皇帝圣旨和清康熙、乾隆墨迹等堪称稀世珍宝。\n" +"\n" ;
    }
    /**
     * 黄山
     */
    public static String getHS() {
        return "黄山1982年入选第一批国家重点风景名胜区；1986年黄山被评选为中国十大风景名胜之一，且是中国十大风景名胜中唯一的山岳风景区；1990年12月黄山风景名胜区作为一项文化与自然双重遗产被联合国教科文组织列入世界遗产名录；2004年2月入选世界地质公园。2015年被世界自然保护联盟列为首批最佳管理自然保护地绿色名录。\n" +
                "黄山被尊为中国山水画的摇篮[3]。明末清初形成的黄山画派以黄山为背景作画，驻足于黄山，潜心体味黄山真景，描绘黄山神妙绝伦的风景名胜。其中代表人物梅清、石涛、渐江更被称为黄山画派三巨子。石涛更是第一次把黄山72峰全部入画。此外黄宾虹自称为“黄山山中人”。\n" +
                "\n" +
                "自古至今，许多的文人墨客都写下了许多吟咏黄山的佳作，包括了李白、贾岛、范成大、老舍、郭沫若、龚自珍等。\n";
    }
    /**
     * 磁器口古镇
     */
    public static String getQCK() {
        return "磁器口古镇位于重庆主城区以西的沙坪坝区，因出产瓷器而得名。瓷器口镇东临嘉陵江，当年是非常热闹的一个水陆码头，后来随着公路的发展，码头逐渐的落败了。如今的磁器口，更多的是市民周末休闲、体验民风民俗的好去处。\n" +
                "\n" +
                "走在磁器口古镇的十几条街巷中，两旁边都是明清风格的建筑，脚下都是青石板路。当然，和其他都市附近的古镇一样，游客眼前的一切，都是近年来重新翻新的。不过这并不影响你在这里感受“老重庆”的风土人情。古镇不大，根据指示牌步行游览完全没有问题。\n" +
                "\n" +
                "你可以去镇里的钟家院、通家院等典型的川东山地民居参观；还可以去镇中的民俗文化村逛逛，这里常年举办川剧、评书等有当地特色的民俗文化活动。还可以和家人去镇里的千年古寺——宝轮寺敬香祈福，据说明朝建文帝曾在此隐居。";
    }

    /**
     * 解放碑步行街
     */
    public static String getJFB() {
        return "解放碑步行街位于重庆市渝中区，历来就是重庆最繁华的商业中心地带。这里有数量众多的百货公司、酒店、饭店等，是重庆购物、美食和走走逛逛的好去处，重庆时尚地标之一。当然，这里更是来重庆打望美女的绝佳去处。步行街以解放碑为中心，包括周边的民权路、民族路、邹容路和八一路和五一路等。\n" +
                "\n" +
                "商场多，小吃多，美女多，是步行街“三多”。你在这里可以逛逛“高大上”的美美时代百货、大都会广场，也有比较平民的重庆百货大楼和太平洋百货；在步行街上你几乎能吃到所有的重庆美食和小吃，这里有八一路好吃街，便宜又好吃的酸辣粉、山城小汤圆和抄手都能在这里找到。而当你步行街上闲逛时，没走几步，就会有一位身材高挑，皮肤白皙的重庆美眉从你身边闪过。\n" +
                "\n" +
                "作为重庆甚至是中国西部地区最繁华的商业街，无论你是“白富美”，还是“屌丝”；无论你是重庆本地人，还是来重庆的游客，在步行街都能找到属于自己的快乐。\n" +
                "\n" +
                "步行街上的解放碑，是全国唯一的一座纪念抗日战争胜利的纪念碑。步行街附近还有能仁寺、罗汉寺等景点。解放碑步行街及周边还是游客在重庆住宿的主要选择之一，这里有洲际酒店、JW万豪酒店等星级酒店，也有性价比很高的经济型酒店。";
    }

    /**
     * 武隆天生三桥
     */
    public static String getSQ() {
        return "天生三硚是中国南方喀斯特世界自然遗产核心景区，国家AAAAA级景区，国家地质公园。天生三硚属典型的喀斯特地貌景观，景区内以三座规模宏大、气势磅礴的天生石桥具有吸引力，石桥平均高300米以上，桥面跨度在500米以上，在一公里距离内就有如此高大的三座天生石桥为世界独有。景区内悬崖百丈、壁立千仞、飞泉流水、鸟语花香，山、水、瀑、峡、桥构成一幅完美的山水画卷。身临其境，将唤起您对大自然的敬畏之心。《变形金刚4》也曾在景区取景拍摄。";
    }

    /**
     * 大足石刻
     */
    public static String getDZSK() {
        return "大足石刻是世界文化遗产、国家首批5A景区、世界八大石窟之一，有“东方艺术明珠”之称，是世界石窟艺术的最后丰碑。大足石刻（The Dazu Rock Carvings），是唐末、宋初时期的宗教摩崖石刻，以佛教题材为主，尤以北山摩崖造像和宝顶山摩崖造像最为著名，是中国著名的古代石刻艺术。北山摩崖造像位于重庆市大足区城北1.5公里的北山。北山摩崖造像长约三百多米，是全国重点文物保护单位、世界文化遗产。造像最初开凿于晚唐景福元年（公元892年），历经后梁、后唐、后晋、后汉、后周五代至南宋1162年完成，历时250多年。现存雕刻造像四千六百多尊，是中国晚期石窟艺术中的优秀代表。";
    }

    /**
     * 白公馆
     */
    public static String getBGG() {
        return "白公馆原为四川大军阀白驹的别墅，1938年开始被国民党特务机关当作关押政治犯的秘密监狱。著名小说《红岩》就是以此为原型，真实再现了当年那段残酷而恐怖的囚禁生活和革命党人矢志不渝的鉴定革命信念。" +
                "白公馆位于重庆市沙坪坝郊区。是解放前国民党的秘密监狱，监狱背靠歌乐山  ，四周高墙、电网密布，墙外制高点上有岗亭和碉堡。大门终年紧闭，只有侧面开一小门与外界相通。狱内有牢房20间。抗日爱国将领黄显声，同济大学校长周均时，爱国人士廖承志，共产党员宋绮云，徐林侠夫妇及幼子“小萝卜头”等均曾被囚禁于此。1943年中美特种技术合作所成立后，白公馆改为招待所，其关押人员被迁往附近的渣滓洞。";
    }

    /**
     * 长江索道
     */
    public static String getCJSD() {
        return "特色1：日观山城，夜瞰灯海，不坐索道，白来重庆\n" +
                "\n" +
                "特色2：重庆城市符号，浪漫、文艺、风情、生动、立体的重庆旅游方式\n" +
                "\n" +
                "特色3：国家AAAA景区，重庆都市旅游空中观光景区，网红景区，打卡圣地\n" +
                "\n" +
                "特色4：穿梭高楼大厦之间、飞渡浩瀚大江之上、行游山水都市之巅，解读山城外形，体验重庆特色，享受“飞越山城，征服重庆”的豪情之美";
    }

    /**
     * 南山风景区
     */
    public static String getNS() {
        return "重庆南山风景区位于重庆长江南岸，并不是一座山，而是一片山脉。这里的一棵树观景台，是观赏山城夜景的好地方；南山植物园是重庆市民春赏花、夏避暑的去处；这里还有抗战博物馆。南山风景区号称重庆的后花园，景区内的南山植物园荟萃中外名花1000余种，是春日赏花的好去处。夏季这里的气温比市中心低几度，成为很多人散步乘凉的好去处。如果你对陪都的历史和建筑遗址有兴趣，不妨到抗战遗迹博物馆转一圈，这里众多的中西合璧的官邸和别墅一定会让你大饱眼福。还可以沿着黄桷古道会到达老君洞，一座依山而建的道观，始建于唐代。逛累了，还可以到附近闻名的泉水一条街大快朵颐，据说这里的泉水鸡是用本地泉水烹调的土鸡，味道很好。晚上到一棵树观景台感受一下重庆的夜景吧，观景台位于南山山腰，可以俯瞰渝中半岛、南岸区，包括两江汇合的景象，山灯与江水交相辉映。";
    }

    /**
     * 白帝城景区
     */
    public static String getBDC() {
        return "奉节白帝城，距奉节新县城8公里，位于长江三峡第一峡瞿塘峡西口，是长江三峡的起点。它濒临瞿塘，虎视夔门，孤峰独峙，气象森严，因距水陆要津，历来为兵家必争之地。" +
                "白帝城因西汉末年，公孙述据蜀，在此筑城，自号“白帝”而得名。又因三国时期刘备讨伐东吴，兵败白帝城，将家事、国事托于丞相诸葛亮而闻名于世。唐宋以来，李白、杜甫、白居易、陆游等历代大诗人在此留下大量诗篇，因此，白帝城又享有诗城之誉。白帝庙内的明良殿、武侯祠、观星亭等建筑均为明清所建，古朴典雅，庄严肃穆。" +
                "东西碑林、竹枝园、（东西碑林已迁移至竹枝园，现为竹枝园碑林）三峡木石艺术馆、古人悬棺馆以及新近开发的“三国卧龙茶苑”以其独具魅力的人文景观，使其长久以来都是中外闻名的旅游胜地。";
    }

    /**
     * 外滩
     */
    public static String getWT() {
        return "外滩是位于上海市中心黄浦江西岸外白渡桥至金陵东路之间的步行观光带，是最具上海城市象征意义的景点之一，万国建筑群、浦江夜景是这里最具魅力的景观。外滩全长1.5公里，由南向北漫步，左手边是宽阔的中山东一路，路边一字排开着数十栋风格迥异的外国建筑；右手边是上海的母亲河——黄浦江，江上巨轮穿梭，江对岸则矗立着东方明珠、金茂大厦、环球金融中心、上海中心大厦等摩天建筑。到了夜晚，浦江两岸霓虹齐放，适合与爱人漫步在外滩，感受着“不夜城”的韵味与浪漫，而夏季的外滩江风阵阵，更是乘凉的好去处。\n" +
                "\n" +
                "外滩景点丰富，最北边的是黄浦公园，上海人民英雄纪念塔在此屹然挺立，塔底是免费开放的外滩历史纪念馆，黄浦公园一旁是著名的外白渡桥，这里也是黄浦江与苏州河的交汇处；外滩中段有陈毅广场、“情人墙”、瀑布钟以及连接浦东和浦西的观光隧道的出入口；外滩最南端就是历史悠久的十六铺码头。此外，丰富的城市雕塑群也是外滩的一大看点。";
    }

    /**
     * 上海迪士尼度假区
     */
    public static String getDSN() {
        return "\uFEFF上海迪士尼度假区是一个特别为中国游客设计和打造的世界级家庭娱乐目的地。这里可供游客尽享多日休闲娱乐时光。整个度假区于2016年6月开幕，包括：\n" +
                "\n" +
                "一座主题乐园——适合所有人游玩、以神奇王国风格打造的“上海迪士尼乐园”，由六大主题园区组成，包括：“米奇大街”、“奇想花园”、“探险岛”、“明日世界”、“宝藏湾”及拥有“奇幻童话城堡”的“梦幻世界”。\n" +
                "\n" +
                "两座主题酒店——包括拥有420间客房、优雅别致的“上海迪士尼乐园酒店”以及拥有800间客房、充满童趣的“玩具总动员酒店”。\n" +
                "\n" +
                "一个国际级的购物餐饮娱乐区——“迪士尼小镇”，“华特迪士尼大剧院”将位于其中。\n" +
                "\n" +
                "一个由静谧的花园和波光粼粼的湖泊组成的休闲区——“星愿公园”，集美丽花园，惬意小道和波光粼粼的湖水于一身。\n" +
                "\n" +
                "上海迪士尼乐园于2016年6月盛大开幕，为所有年龄层的中国游客呈现令人流连忘返的神奇体验。您将可以探索一个前所未有的神奇世界，每个人都能在这里点亮心中奇梦。这就是上海迪士尼乐园，充满创造力、冒险精神与无穷精彩的快乐天地。您可在此游览全球较大的迪士尼城堡——奇幻童话城堡，探索别具一格又令人难忘的六大主题园区——米奇大街、奇想花园、梦幻世界、探险岛、宝藏湾和明日世界。";
    }

    /**
     * 南京路步行街
     */
    public static String getNJL_BXJ() {
        return "南京路步行街长约1200米，两侧商店林立，一眼望去，现代建筑夹杂着欧式老楼，竖挂的店铺灯箱连绵不绝，尤其夜幕之下霓虹灯光闪烁，别有风情。在这里逛一逛众多百货大楼和老字号商店，买写特色伴手礼回去，还可以坐一回像缩小版旧式电车的“铛铛车”，找找老上海的味道。";
    }

    /**
     * 上海长风海洋世界
     */
    public static String getCF_HYSJ() {
        return "上海长风海洋世界水族馆建于银锄湖底13米处，以自然海洋为主题，拥有超过300余种，万余海洋水生生物。共分为与鳐共舞、触摸星地带、世界热带雨林奇观、海马王国、缤纷珊瑚带、深海秘境、鲨鱼甬道、种类繁多的海洋生物、栩栩如生的主题造景、寓教于乐的创意互动，将人与自然完美融合。";
    }

    /**
     * 朱家角古镇景区
     */
    public static String getZJJ() {
        return "苍苍九峰北麓，茫茫淀山湖之滨，有块47平方公里成折扇形的小镇，镶嵌在湖光山色之中。有人把她比作上海的威尼斯，有人把她比作淀山湖畔一颗明珠，如今这颗璀璨明珠又在“金色玉带”—318国道的依托下，放射出更夺目的光彩。这就是闻名遐迩的千年古镇朱家角，1991年被上海市政府命名为首批四大文化名镇之一。名镇朱家角迷人的自然风光，在一山一湖。真山真水显现出江南水乡之特色，山名叫淀山，山虽不高，名气极大，为浙西天目余脉，此山为始，如登山望湖，有“淀峰晚照”一景可赏。湖，即天然淡水淀山湖，面积达62平方公里，湖东区大部分在朱家角境区，有11个杭州西湖面积大，乘艇游湖，茫茫水天一色，湖区芦苇轻摇，惊起野鸭水鸟，顿觉远离尘嚣，心旷神怡。名镇朱家角更迷人、更具古镇特色的人文景观，是一桥、一街、一寺、一庙、一厅、一馆、二园、三湾、二十六弄。如果说九百岁的水镇周庄小巧精致、似小家碧玉，而千年古镇朱家角则具气势磅礴、大家闺秀的风采。首先朱家角古镇面积达1.5平方公里，为周庄面积的三倍多，家大，自然游玩的地方就多，漕港河将朱家角分成两半，北岸井亭港，南岸北大街，两岸遍布蜿蜒曲折的小巷，花岗岩石的街面，青砖黛瓦的明清建筑及众多的历史遗迹。";
    }
}